import 'package:first_project/homework9/models/recipe.dart';

final List<Recipe> seedRecipes = [
  Recipe(
    title: "Омлет класичний",
    description: "Простий та швидкий сніданок",
    ingredients: [
      "Яйця — 3 шт",
      "Молоко — 50 мл",
      "Сіль — за смаком",
      "Олія — 1 ст.л."
    ],
    steps: [
      "Збити яйця з молоком та сіллю",
      "Розігріти сковорідку",
      "Вилити суміш та готувати 3–4 хв"
    ],
  ),
  Recipe(
    title: "Борщ український",
    description: "Традиційний наваристий борщ",
    ingredients: [
      "Свинина — 300 г",
      "Буряк — 1 шт",
      "Цибуля — 1 шт",
      "Морква — 1 шт",
      "Картопля — 3 шт",
      "Капуста — 200 г",
      "Томатна паста — 1 ст.л.",
    ],
    steps: [
      "Зварити бульйон зі свининою",
      "Додати картоплю",
      "Приготувати засмажку з буряка, цибулі та моркви",
      "Додати засмажку",
      "Покласти капусту",
      "Варити до готовності"
    ],
  ),
  Recipe(
    title: "Млинці на молоці",
    description: "Тонкі та ніжні млинці",
    ingredients: [
      "Молоко — 500 мл",
      "Яйця — 2 шт",
      "Борошно — 250 г",
      "Сіль — щіпка",
      "Цукор — 1 ст.л."
    ],
    steps: [
      "Змішати яйця з сіллю та цукром",
      "Влити молоко",
      "Додати борошно і перемішати",
      "Смажити на розігрітій сковороді"
    ],
  ),
];